//---------------------------------------------------------
//
// 建物管理
// Author::TAKANO
//
//---------------------------------------------------------
#ifndef _BILDINGMANAGER_H_
#define _BILDINGMANAGER_H_

//----------------------------------------
//インクルードファイル
//----------------------------------------
#include <d3dx9.h>

//----------------------------------------
//前方宣言
//----------------------------------------
class CBilding;

//----------------------------------------
//マクロ定義
//----------------------------------------
#define OPEN_FILE			"Data/Text/SetBuilding.txt"			//読み込むファイル

//----------------------------------------
//定数定義
//----------------------------------------
static const int MAX_BILDING = 64;

//----------------------------------------
//クラス定義
//敵出現を総括するクラス
//----------------------------------------
class CBildingManager
{
public:
	/*一般関数*/
	CBildingManager();													//コンストラクタ
	~CBildingManager();													//デストラクタ
	HRESULT Init();														//初期化
	void Uninit();														//終了
	void Update();														//更新
	void Draw();														//描画

/*建物で管理する関数*/
public:
	void Load();

	void Save();

/*ビルディングジャーマネで管理するメンバ変数*/
private:
	CBilding* m_pBilding;						//建物のポインター
};

#endif // !_BILDINGMANAGER_H_
