//-----------------------------------------------------------------
//
//ライト
//Author:takano
//
//-----------------------------------------------------------------
#ifndef _LIGHT_H_													//このマクロ定義がなされなっかたら
#define _LIGHT_H_													//二重インクルード防止のマクロ定義

//-----------------------------------------------------------
//インクルードファイル
//-----------------------------------------------------------
#include <d3dx9.h>

//-----------------------------------------------------------
//クラス定義
//ライト
//-----------------------------------------------------------
class CLight
{
public:
	CLight();										//コンストラクタ
	~CLight();										//デストラクタ
	static CLight * Create(D3DXVECTOR3 pos);		//生成
	void Init();									//初期化
	void Uninit();									//終了
	void Update();									//更新

private:
	D3DLIGHT9 m_Light[2];							//ライトの数
	D3DXVECTOR3 m_vecDir[2];						//ライトの方向
};

#endif // !LIGHT_H_
